
&НаКлиенте
Процедура ГР_НастроитьПараметрыИзмененияВместо(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ИзменятьВТранзакции",    Объект.ИзменятьВТранзакции);
	ПараметрыФормы.Вставить("ОбрабатыватьРекурсивно", ОбрабатыватьРекурсивно);
	ПараметрыФормы.Вставить("ПрерыватьПриОшибке",     Объект.ПрерыватьПриОшибке);
	ПараметрыФормы.Вставить("НастройкаПорции",        ТОНастройкаПорции);
	ПараметрыФормы.Вставить("ПроцентОбъектовВПорции", ТОПроцентОбъектовВПорции);
	ПараметрыФормы.Вставить("ЧислоОбъектовВПорции",   ТОЧислоОбъектовВПорции);
	ПараметрыФормы.Вставить("УчитыватьИерархию",      УчитыватьИерархию);
	ПараметрыФормы.Вставить("ПоказыватьСлужебныеРеквизиты",     Объект.ПоказыватьСлужебныеРеквизиты);
	ПараметрыФормы.Вставить("КонтекстныйВызов", КонтекстныйВызов);
	ПараметрыФормы.Вставить("РежимРазработчика", Объект.РежимРазработчика);
	ПараметрыФормы.Вставить("ОтключитьСвязиПараметровВыбора", ОтключитьСвязиПараметровВыбора);
	
	ПараметрыФормы.Вставить("ГР_ВыполнитьКодПередЗаписьюЭлемента", Объект.ГР_ВыполнитьКодПередЗаписьюЭлемента);
	ПараметрыФормы.Вставить("ГР_КодПередЗаписью", Объект.ГР_КодПередЗаписью);
	ПараметрыФормы.Вставить("ГР_ВидыИзменяемыхОбъектов", ВидыИзменяемыхОбъектов);
	
	ОткрытьФорму(ПолноеИмяФормы("ДополнительныеПараметры"), ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГР_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег(ПолноеИмяФормы("ДополнительныеПараметры")) Тогда
		Объект.ГР_ВыполнитьКодПередЗаписьюЭлемента = ВыбранноеЗначение.ГР_ВыполнитьКодПередЗаписьюЭлемента;
		Объект.ГР_КодПередЗаписью = ВыбранноеЗначение.ГР_КодПередЗаписью;
	КонецЕсли;
КонецПроцедуры

&После("ИнициализироватьНастройкиФормы")
&НаСервере
Процедура ГР_ИнициализироватьНастройкиФормы()
	Возврат;//Далее идет устаревший код
	Если ВидыИзменяемыхОбъектов = "Справочник.Номенклатура" Тогда
		Объект.ГР_КодПередЗаписью = "
		|РеквизитыВидаНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ИзменяемыйОбъект.ВидНоменклатуры, ""ШаблонРабочегоНаименованияНоменклатуры,ШаблонНаименованияДляПечатиНоменклатуры"");
		|
		|Если не пустаястрока(РеквизитыВидаНоменклатуры.ШаблонРабочегоНаименованияНоменклатуры) Тогда
		|	Параметры.ИзменяемыйОбъект.Наименование = НоменклатураСервер.НаименованиеПоШаблону(РеквизитыВидаНоменклатуры.ШаблонРабочегоНаименованияНоменклатуры, Параметры.ИзменяемыйОбъект);
		|КонецЕсли;
		|Если не пустаястрока(РеквизитыВидаНоменклатуры.ШаблонНаименованияДляПечатиНоменклатуры) Тогда
		|	Параметры.ИзменяемыйОбъект.НаименованиеПолное = НоменклатураСервер.НаименованиеПоШаблону(РеквизитыВидаНоменклатуры.ШаблонНаименованияДляПечатиНоменклатуры, Параметры.ИзменяемыйОбъект);
		|КонецЕсли;";
	КонецЕсли;
КонецПроцедуры



